
# coding:utf-8


mydict = {'抬头纹': [[('抬头纹', '所属科室', '皮肤科'), ('皮肤科', '属于', '皮肤性病科')], [('抬头纹', '并发症', '炎症后弹力纤维松解伴皮肤松弛'), ('炎症后弹力纤维松解伴皮肤松弛', '所属科室', '皮肤科')], [('抬头纹', '症状', '膨胀性萎缩纹')], [('抬头纹', '诊断检查', '皮肤弹性检查')], [('抬头纹', '诊断检查', '免疫病理检查')], [('抬头纹', '好评药品', '盐酸氯环利嗪片')], [('抬头纹', '好评药品', '氯雷他定糖浆'), ('氯雷他定糖浆', '生产药品', '氯雷他定糖浆')], [('抬头纹', '好评药品', '醋酸氟轻松乳膏'), ('醋酸氟轻松乳膏', '生产药品', '醋酸氟轻松乳膏')], [('抬头纹', '好评药品', '咪康唑氯倍他索乳膏')], [('抬头纹', '好评药品', '马来酸氯苯那敏片')], [('抬头纹', '好评药品', '氯雷他定胶囊')], [('抬头纹', '好评药品', '复方樟脑乳膏')], [('抬头纹', '好评药品', '复方曲安奈德乳膏')], [('抬头纹', '好评药品', '盐酸异丙嗪片')], [('抬头纹', '好评药品', '醋酸曲安奈德尿素软膏')], [('抬头纹', '好评药品', '醋酸曲安奈德乳膏')], [('抬头纹', '好评药品', '氟轻松维B6乳膏')], [('抬头纹', '好评药品', '氯雷他定片')], [('抬头纹', '常用药品', '氯雷他定糖浆')], [('抬头纹', '常用药品', '氯雷他定片')], [('抬头纹', '宜吃', '绿豆芽')], [('抬头纹', '宜吃', '豆腐')], [('抬头纹', '宜吃', '豌豆')], [('抬头纹', '宜吃', '赤小豆')], [('抬头纹', '忌吃', '辣椒(红、尖、干)')], [('抬头纹', '忌吃', '芥菜')], [('抬头纹', '忌吃', '腊肉(生)')], [('抬头纹', '忌吃', '青蒜')], [('抬头纹', '推荐食谱', '豆芽豆腐汤')], [('抬头纹', '推荐食谱', '鸡蓉豆腐')], [('抬头纹', '推荐食谱', '蟹黄豆腐羹')], [('抬头纹', '推荐食谱', '小米蛋奶粥')], [('抬头纹', '推荐食谱', '豆腐海鲜汤')], [('抬头纹', '推荐食谱', '平菇豆腐汤')], [('抬头纹', '推荐食谱', '小米红枣粥')], [('抬头纹', '推荐食谱', '小米素羹')]], '炎症后弹力纤维松解伴皮肤松弛': [[('炎症后弹力纤维松解伴皮肤松弛', '并发症', '荨麻疹'), ('荨麻疹', '推荐食谱', '开水白菜')], [('炎症后弹力纤维松解伴皮肤松弛', '症状', '嗜酸性粒细胞增多')], [('炎症后弹力纤维松解伴皮肤松弛', '症状', '丘疹')], [('炎症后弹力纤维松解伴皮肤松弛', '症状', '闫铁')], [('炎症后弹力纤维松解伴皮肤松弛', '症状', '鳞屑')], [('炎症后弹力纤维松解伴皮肤松弛', '症状', '血沉增快')], [('炎症后弹力纤维松解伴皮肤松弛', '症状', '胀痛')], [('炎症后弹力纤维松解伴皮肤松弛', '症状', '瘙痒')], [('炎症后弹力纤维松解伴皮肤松弛', '诊断检查', '尿常规')], [('炎症后弹力纤维松解伴皮肤松弛', '诊断检查', '血常规')], [('炎症后弹力纤维松解伴皮肤松弛', '诊断检查', '皮肤涂片显微镜检查')], [('炎症后弹力纤维松解伴皮肤松弛', '诊断检查', '便常规')]], '荨麻疹': [[('荨麻疹', '推荐食谱', '煮青豆泥')], [('荨麻疹', '推荐食谱', '凉拌空心菜')], [('荨麻疹', '推荐食谱', '木耳鸭肝烩')], [('荨麻疹', '推荐食谱', '时蔬小豆腐')], [('荨麻疹', '推荐食谱', '鸡油菜心')], [('荨麻疹', '推荐食谱', '赤小豆粥')], [('荨麻疹', '推荐食谱', '开洋大白菜')], [('荨麻疹', '忌吃', '猪大肠')], [('荨麻疹', '忌吃', '啤酒')], [('荨麻疹', '忌吃', '猪肚')], [('荨麻疹', '忌吃', '白扁豆')], [('荨麻疹', '宜吃', '鸡肝')], [('荨麻疹', '宜吃', '鸭肝')], [('荨麻疹', '宜吃', '鸡心')], [('荨麻疹', '宜吃', '芝麻')], [('荨麻疹', '所属科室', '皮肤科')], [('荨麻疹', '常用药品', '氯雷他定胶囊')], [('荨麻疹', '常用药品', '氯雷他定片')], [('荨麻疹', '好评药品', '氯雷他定胶囊')], [('荨麻疹', '好评药品', '盐酸非索非那定片')], [('荨麻疹', '好评药品', '防风通圣丸')], [('荨麻疹', '好评药品', '氯雷他定片')], [('荨麻疹', '好评药品', '盐酸西替利嗪滴剂')], [('荨麻疹', '好评药品', '盐酸西替利嗪片')], [('荨麻疹', '好评药品', '盐酸苯海拉明片')], [('荨麻疹', '好评药品', '肤痒颗粒')], [('荨麻疹', '好评药品', '盐酸异丙嗪片')], [('荨麻疹', '诊断检查', '抗甲状腺抗体')], [('荨麻疹', '诊断检查', '皮内试验')], [('荨麻疹', '诊断检查', '嗜碱性粒细胞计数（B）')], [('荨麻疹', '诊断检查', '组织胺激发试验')], [('荨麻疹', '诊断检查', '血清补体C4含量测定')], [('荨麻疹', '诊断检查', '血常规')], [('荨麻疹', '诊断检查', '嗜碱性粒细胞数')], [('荨麻疹', '诊断检查', '乙肝病毒学指标')], [('荨麻疹', '诊断检查', '献血者健康检查')], [('荨麻疹', '症状', '剧痒')], [('荨麻疹', '症状', '多形红斑样皮疹')], [('荨麻疹', '症状', '风团')], [('荨麻疹', '症状', '尿中组织胺排泄增加')], [('荨麻疹', '症状', '斑丘疹')], [('荨麻疹', '症状', '岳军')], [('荨麻疹', '症状', '淋巴结肿大')], [('荨麻疹', '症状', '鳞屑')], [('荨麻疹', '症状', '粪便中查见虫卵...')], [('荨麻疹', '并发症', '喉水肿')]]}


def getAllPath():

    for i in mydict:
        print(i)
        print(mydict[i])
        for j in mydict[i]:
            if len(j) > 1:
                for index, value in enumerate(j):
                    if index == 0:
                        print('->'.join([value[0], value[1], value[2]]), end="")
                    else:
                        print('->'+'->'.join([value[1], value[2]]))
                        # print(index, value)
                    # exit()
            else:
                # print(j)
                print('->'.join([j[0][0], j[0][1], j[0][2]]))
        exit()


def getNextPath(path, text):
    data = text.split('->')
    mytriple = (data[0], data[1], data[2])
    print(mytriple)
    info_list = []
    for i in path[data[0]]:
        for j in i:
            if j==mytriple:
                info_list.append(i)
    print(info_list)
    print(path[data[2]])

    leval1 = path[data[2]]
    # leval1.append(info_list[0])
    leval1KP = []
    preRea = ''
    preHead = ''
    end_list = []
    count = 0
    for i in leval1:
        # print(i)
        head = i[0][0]
        relation = i[0][1]
        tail = i[0][2]
        if relation != preRea and count != 0:
            knowledgePath = preHead + "->" + preRea + "->" + "、".join(end_list)
            # print(knowledgePath)
            leval1KP.append(knowledgePath)
            # print(knowledgePath)
            end_list = []
            end_list.append(tail)  # 虽然已经不一样了，把当前实体加进去，防止丢失。
            if count == len(leval1) - 1:
                knowledgePath = head + "->" + relation + "->" + "、".join(end_list)
                # print(knowledgePath)
                leval1KP.append(knowledgePath)
        else:
            end_list.append(tail)
        preRea = relation
        preHead = head
        count += 1

    level1Rela = []
    for i in leval1KP:
        print(i)
        rela = (i.split("->")[1])
        level1Rela.append(rela)
    print(level1Rela)

def staticEntityRelation(mydict):
    all_word = []
    print("字典大小为： ", len(mydict))
    for i in mydict:
        print(i, len(mydict[i]))
        for j in mydict[i]:
            # print(j)
            for m in j:
                if m[0] not in all_word:
                    all_word.append(m[0])
                if m[2] not in all_word:
                    all_word.append(m[2])
    print("all word: ", len(all_word))
        # exit()

if __name__=='__main__':
    # a_dict =
    staticEntityRelation(mydict)
    # getNextPath(a_dict, '荨麻疹->并发症->喉水肿')
    a = {'流痰': [[('流痰', '所属科室', '中医综合'), ('中医综合', '属于', '中医科')],
              [('流痰', '并发症', '肌肉萎缩'), ('肌肉萎缩', '推荐食谱', '香菇炒菜花')], [('流痰', '症状', '盗汗')],
              [('流痰', '症状', '食欲减退')], [('流痰', '症状', '失眠'), ('失眠', '推荐食谱', '甘草小麦大枣汤')],
              [('流痰', '症状', '消瘦')], [('流痰', '症状', '肌肉萎缩')], [('流痰', '症状', '畏寒')],
              [('流痰', '症状', '脓肿'), ('脓肿', '推荐食谱', '紫菜瘦肉粥')], [('流痰', '诊断检查', '便常规')],
              [('流痰', '诊断检查', '脓汁和创伤感染标本细菌学检查')], [('流痰', '诊断检查', '四肢的骨和关节平片')],
              [('流痰', '诊断检查', '关节腔液检查')], [('流痰', '诊断检查', '结核杆菌的抗原、抗体检查')],
              [('流痰', '诊断检查', '尿常规')], [('流痰', '诊断检查', '血常规')], [('流痰', '好评药品', '滑膜炎片')],
              [('流痰', '好评药品', '阿咖片')],
              [('流痰', '好评药品', '注射用头孢尼西钠'), ('注射用头孢尼西钠', '生产药品', '注射用头孢尼西钠')],
              [('流痰', '好评药品', '法罗培南钠胶囊')], [('流痰', '好评药品', '氟氯西林钠阿莫西林胶囊')],
              [('流痰', '好评药品', '注射用头孢呋辛钠'), ('注射用头孢呋辛钠', '生产药品', '注射用头孢呋辛钠')],
              [('流痰', '好评药品', '注射用头孢噻肟钠'), ('注射用头孢噻肟钠', '生产药品', '注射用头孢噻肟钠')],
              [('流痰', '好评药品', '吡罗昔康软膏')],
              [('流痰', '好评药品', '滑膜炎颗粒'), ('滑膜炎颗粒', '生产药品', '滑膜炎颗粒')],
              [('流痰', '好评药品', '头孢羟氨苄甲氧苄啶胶囊')], [('流痰', '常用药品', '滑膜炎片')],
              [('流痰', '常用药品', '滑膜炎颗粒')], [('流痰', '宜吃', '鸭蛋')], [('流痰', '宜吃', '鸡肉')],
              [('流痰', '宜吃', '腰果')], [('流痰', '宜吃', '鸡蛋')], [('流痰', '忌吃', '绿豆')],
              [('流痰', '忌吃', '鸭血(白鸭)')], [('流痰', '忌吃', '田螺')], [('流痰', '忌吃', '沙丁鱼')],
              [('流痰', '推荐食谱', '南瓜牛奶汁')], [('流痰', '推荐食谱', '牛奶花生粥')],
              [('流痰', '推荐食谱', '牛奶麦片粥')], [('流痰', '推荐食谱', '牛奶玉米汤')],
              [('流痰', '推荐食谱', '菖蒲白术酒')], [('流痰', '推荐食谱', '桔梗甘草茶')],
              [('流痰', '推荐食谱', '白术扣烧牛肉')]],
     '肌肉萎缩': [[('肌肉萎缩', '推荐食谱', '花生豆奶')], [('肌肉萎缩', '推荐食谱', '珍珠菜花汤')],
                  [('肌肉萎缩', '推荐食谱', '菜花肉饼')], [('肌肉萎缩', '推荐食谱', '豆芽炖猪排骨')],
                  [('肌肉萎缩', '推荐食谱', '白萝卜炖猪排骨')], [('肌肉萎缩', '推荐食谱', '红豆花生红枣粥')],
                  [('肌肉萎缩', '推荐食谱', '花生杏仁粥')], [('肌肉萎缩', '忌吃', '海螺')],
                  [('肌肉萎缩', '忌吃', '白扁豆')], [('肌肉萎缩', '忌吃', '赤小豆')], [('肌肉萎缩', '忌吃', '田螺')],
                  [('肌肉萎缩', '宜吃', '鸡心')], [('肌肉萎缩', '宜吃', '青豆')], [('肌肉萎缩', '宜吃', '莲子')],
                  [('肌肉萎缩', '宜吃', '花生仁（生）')],
                  [('肌肉萎缩', '所属科室', '神经内科'), ('神经内科', '属于', '内科')],
                  [('肌肉萎缩', '常用药品', '利鲁唑片'), ('利鲁唑片', '生产药品', '利鲁唑片')],
                  [('肌肉萎缩', '常用药品', '三磷酸腺苷二钠注射液')], [('肌肉萎缩', '好评药品', '利鲁唑片')],
                  [('肌肉萎缩', '好评药品', '三磷酸腺苷二钠注射液')], [('肌肉萎缩', '诊断检查', '呼吸肌张力的测定')],
                  [('肌肉萎缩', '诊断检查', '脑诱发电位')], [('肌肉萎缩', '诊断检查', '神经系统检查')],
                  [('肌肉萎缩', '诊断检查', '视觉诱发电位')], [('肌肉萎缩', '诊断检查', '肌电图')],
                  [('肌肉萎缩', '症状', '肌肉疼痛')], [('肌肉萎缩', '症状', '肩胛带肌肉萎缩')],
                  [('肌肉萎缩', '症状', '手臂肌肉拉伤')], [('肌肉萎缩', '症状', '大腿肌肉萎缩')],
                  [('肌肉萎缩', '症状', '面肌萎缩')],
                  [('肌肉萎缩', '症状', '重症肌无力'), ('重症肌无力', '推荐食谱', '油豆腐油菜')],
                  [('肌肉萎缩', '症状', '骨间肌和鱼际肌萎缩')], [('肌肉萎缩', '症状', '小腿肌肉萎缩')],
                  [('肌肉萎缩', '症状', '臀中肌损伤')], [('肌肉萎缩', '症状', '手肌肉萎缩')],
                  [('肌肉萎缩', '并发症', '重症肌无力样综合征'), ('重症肌无力样综合征', '所属科室', '神经内科')],
                  [('肌肉萎缩', '并发症', '肌营养不良症'), ('肌营养不良症', '所属科室', '神经内科')]],
     '重症肌无力': [[('重症肌无力', '推荐食谱', '鸭肝浓香粥')], [('重症肌无力', '推荐食谱', '香菇油菜面筋粥')],
                    [('重症肌无力', '推荐食谱', '糟香鸭肝')], [('重症肌无力', '推荐食谱', '冬菜鸭肝汤')],
                    [('重症肌无力', '推荐食谱', '苦瓜粥')], [('重症肌无力', '推荐食谱', '白萝卜油菜汁')],
                    [('重症肌无力', '推荐食谱', '油菜丝炒面')], [('重症肌无力', '忌吃', '白酒')],
                    [('重症肌无力', '忌吃', '杏仁')], [('重症肌无力', '忌吃', '咸鸭蛋')],
                    [('重症肌无力', '忌吃', '腐竹')], [('重症肌无力', '宜吃', '鸭肝')],
                    [('重症肌无力', '宜吃', '鸡爪')], [('重症肌无力', '宜吃', '葵花子仁')],
                    [('重症肌无力', '宜吃', '鸡蛋')], [('重症肌无力', '所属科室', '神经内科')],
                    [('重症肌无力', '常用药品', '溴吡斯的明片')], [('重症肌无力', '常用药品', '硫唑嘌呤片')],
                    [('重症肌无力', '好评药品', '甲硫酸新斯的明注射液')], [('重症肌无力', '好评药品', '硫唑嘌呤片')],
                    [('重症肌无力', '好评药品', '溴新斯的明片')], [('重症肌无力', '好评药品', '氢溴酸加兰他敏注射液')],
                    [('重症肌无力', '好评药品', '溴吡斯的明片')], [('重症肌无力', '好评药品', '注射用石杉碱甲')],
                    [('重症肌无力', '好评药品', '醋酸可的松片')], [('重症肌无力', '好评药品', '健步壮骨丸')],
                    [('重症肌无力', '好评药品', '醋酸可的松注射液')], [('重症肌无力', '诊断检查', '抗骨骼肌抗体（ASA）')],
                    [('重症肌无力', '诊断检查', '新斯的明试验')], [('重症肌无力', '诊断检查', '肌电图')],
                    [('重症肌无力', '诊断检查', '抗乙酸胆碱受体抗体（anti-AchR）')],
                    [('重症肌无力', '诊断检查', '抗乙酰胆碱受体抗体（AchR-Ab）')],
                    [('重症肌无力', '诊断检查', '疲劳试验')], [('重症肌无力', '诊断检查', '肌红蛋白')],
                    [('重症肌无力', '诊断检查', '神经系统检查')], [('重症肌无力', '诊断检查', '神经系统核医学检查')],
                    [('重症肌无力', '症状', '感觉障碍')], [('重症肌无力', '症状', '手无力不自觉的...')],
                    [('重症肌无力', '症状', '肩胛带肌肉萎缩')], [('重症肌无力', '症状', '肌肉假肥大')],
                    [('重症肌无力', '症状', '肌体张力异常')], [('重症肌无力', '症状', '睡眠时睑闭合不全')],
                    [('重症肌无力', '症状', '呼吸困难')], [('重症肌无力', '症状', '疲劳')],
                    [('重症肌无力', '症状', '构音障碍')], [('重症肌无力', '症状', '乏力')],
                    [('重症肌无力', '并发症', '重症肌无力危象')]],
     '重症肌无力样综合征': [[('重症肌无力样综合征', '并发症', '尿路感染')],
                            [('重症肌无力样综合征', '症状', '肌性肌无力')],
                            [('重症肌无力样综合征', '症状', '反拗危象')],
                            [('重症肌无力样综合征', '症状', '肌张力减低')], [('重症肌无力样综合征', '症状', '疲劳')],
                            [('重症肌无力样综合征', '症状', '面肌无力')],
                            [('重症肌无力样综合征', '症状', '肌无力危象')],
                            [('重症肌无力样综合征', '症状', '胆碱能危象')],
                            [('重症肌无力样综合征', '症状', '呼吸困难')],
                            [('重症肌无力样综合征', '诊断检查', '肌电图')],
                            [('重症肌无力样综合征', '诊断检查', '血液电解质检查')],
                            [('重症肌无力样综合征', '诊断检查', '腾喜龙试验')],
                            [('重症肌无力样综合征', '诊断检查', '血液检查')],
                            [('重症肌无力样综合征', '好评药品', '硫唑嘌呤片')],
                            [('重症肌无力样综合征', '好评药品', '氢溴酸加兰他敏注射液')],
                            [('重症肌无力样综合征', '好评药品', '甲硫酸新斯的明注射液')],
                            [('重症肌无力样综合征', '好评药品', '健步壮骨丸')],
                            [('重症肌无力样综合征', '好评药品', '醋酸可的松注射液')],
                            [('重症肌无力样综合征', '好评药品', '溴新斯的明片')],
                            [('重症肌无力样综合征', '好评药品', '溴吡斯的明片')],
                            [('重症肌无力样综合征', '好评药品', '醋酸可的松片')],
                            [('重症肌无力样综合征', '好评药品', '注射用石杉碱甲')],
                            [('重症肌无力样综合征', '常用药品', '硫唑嘌呤片')],
                            [('重症肌无力样综合征', '常用药品', '溴吡斯的明片')]],
     '肌营养不良症': [[('肌营养不良症', '并发症', '褥疮')], [('肌营养不良症', '症状', '两臂不能上举而成垂肩')],
                      [('肌营养不良症', '症状', '面肌无力')], [('肌营养不良症', '症状', '良性假肥大型肌...')],
                      [('肌营养不良症', '症状', '不能露齿及突唇')], [('肌营养不良症', '症状', '氮负平衡')],
                      [('肌营养不良症', '症状', '肌肉假肥大')], [('肌营养不良症', '症状', '肌肉萎缩')],
                      [('肌营养不良症', '症状', '肌肉肥大')], [('肌营养不良症', '诊断检查', '血清醛缩酶')],
                      [('肌营养不良症', '诊断检查', '血清醛缩酶(ALD)')], [('肌营养不良症', '诊断检查', '肌红蛋白')],
                      [('肌营养不良症', '诊断检查', '肌电图')], [('肌营养不良症', '诊断检查', '蛋白质浓度测定')],
                      [('肌营养不良症', '诊断检查', '鸭步检测')], [('肌营养不良症', '好评药品', '薄芝糖肽注射液')],
                      [('肌营养不良症', '好评药品', '维生素E软胶囊')],
                      [('肌营养不良症', '好评药品', '三磷酸腺苷二钠片')],
                      [('肌营养不良症', '常用药品', '维生素E软胶囊')],
                      [('肌营养不良症', '常用药品', '三磷酸腺苷二钠片')], [('肌营养不良症', '宜吃', '葵花子仁')],
                      [('肌营养不良症', '宜吃', '黑豆')], [('肌营养不良症', '宜吃', '鸭肝')],
                      [('肌营养不良症', '宜吃', '白果（干）')], [('肌营养不良症', '忌吃', '白酒')],
                      [('肌营养不良症', '忌吃', '鹅肉')], [('肌营养不良症', '忌吃', '花生')],
                      [('肌营养不良症', '忌吃', '油豆腐')], [('肌营养不良症', '推荐食谱', '紫菜虾皮汤')],
                      [('肌营养不良症', '推荐食谱', '冬菇椰菜豆腐粉丝汤')],
                      [('肌营养不良症', '推荐食谱', '鲜菇烧豆腐')], [('肌营养不良症', '推荐食谱', '虾仁豆腐羹')],
                      [('肌营养不良症', '推荐食谱', '香菇豆苗萝卜汤')],
                      [('肌营养不良症', '推荐食谱', '珍珠笋番茄蘑菇汤')],
                      [('肌营养不良症', '推荐食谱', '雪菜虾仁豆腐羹')], [('肌营养不良症', '推荐食谱', '清炒虾仁')]],
     '失眠': [[('失眠', '推荐食谱', '桂枝大枣汤')], [('失眠', '推荐食谱', '萝卜枸杞炖鸭肝')],
              [('失眠', '推荐食谱', '猴头菇炖鸡')], [('失眠', '推荐食谱', '灵芝大枣汤')],
              [('失眠', '推荐食谱', '冬菜鸭肝汤')], [('失眠', '推荐食谱', '牛奶大枣汤')],
              [('失眠', '推荐食谱', '荔枝干大枣汤')], [('失眠', '忌吃', '猪油（板油）')], [('失眠', '忌吃', '油条')],
              [('失眠', '忌吃', '淡菜(鲜)')], [('失眠', '忌吃', '河蚌')], [('失眠', '宜吃', '鸭肝')],
              [('失眠', '宜吃', '腰果')], [('失眠', '宜吃', '鸡肝')], [('失眠', '宜吃', '鸡心')],
              [('失眠', '所属科室', '精神科')], [('失眠', '常用药品', '二十五味珊瑚丸')],
              [('失眠', '常用药品', '枣仁安神颗粒')], [('失眠', '好评药品', '养血清脑丸')],
              [('失眠', '好评药品', '消疲灵颗粒')], [('失眠', '好评药品', '珍珠末')],
              [('失眠', '好评药品', '二十五味珊瑚丸')], [('失眠', '好评药品', '红芪口服液')],
              [('失眠', '好评药品', '安眠补脑口服液')], [('失眠', '好评药品', '二十味肉豆蔻丸')],
              [('失眠', '好评药品', '长春胺缓释胶囊')], [('失眠', '好评药品', '复方首乌补液')],
              [('失眠', '好评药品', '解郁安神颗粒')], [('失眠', '好评药品', '刺五加颗粒')],
              [('失眠', '好评药品', '桂龙药膏')], [('失眠', '好评药品', '阿胶')], [('失眠', '好评药品', '脑灵素胶囊')],
              [('失眠', '好评药品', '养血安神颗粒')], [('失眠', '好评药品', '安神补脑液')],
              [('失眠', '好评药品', '固本回元口服液')], [('失眠', '好评药品', '补肾益脑丸')],
              [('失眠', '好评药品', '谷维素片')], [('失眠', '好评药品', '枣仁安神颗粒')],
              [('失眠', '好评药品', '安乐片')], [('失眠', '好评药品', '景志安神口服液')],
              [('失眠', '诊断检查', '心电图')], [('失眠', '诊断检查', '核磁共振成像(MRI)')],
              [('失眠', '诊断检查', '血常规')], [('失眠', '诊断检查', 'CT检查')], [('失眠', '诊断检查', '维生素H')],
              [('失眠', '症状', '难入睡或易惊醒')], [('失眠', '症状', '决断困难感')], [('失眠', '症状', '顽固性失眠')],
              [('失眠', '症状', '浅眠')], [('失眠', '症状', '入睡幻觉')], [('失眠', '症状', '对声音敏感')],
              [('失眠', '症状', '失眠头痛')], [('失眠', '症状', '入睡困难')], [('失眠', '症状', '噩梦')],
              [('失眠', '症状', '衰弱')], [('失眠', '并发症', '抑郁症'), ('抑郁症', '推荐食谱', '枸杞子炖牛肉（二）')]],
     '抑郁症': [[('抑郁症', '推荐食谱', '桂圆肉蒸蛋')], [('抑郁症', '推荐食谱', '蘑菇莲子鸭汤')],
                [('抑郁症', '推荐食谱', '莲子红豆沙')], [('抑郁症', '推荐食谱', '桂圆肉粥')],
                [('抑郁症', '推荐食谱', '莲子猪肚')], [('抑郁症', '推荐食谱', '银耳莲子枸杞粥')],
                [('抑郁症', '推荐食谱', '莲子淮山炖薏米')], [('抑郁症', '忌吃', '啤酒')],
                [('抑郁症', '忌吃', '白扁豆')], [('抑郁症', '忌吃', '赤小豆')], [('抑郁症', '忌吃', '螃蟹')],
                [('抑郁症', '宜吃', '鸡心')], [('抑郁症', '宜吃', '腰果')], [('抑郁症', '宜吃', '鸡肝')],
                [('抑郁症', '宜吃', '鸡肉')], [('抑郁症', '所属科室', '心理科')],
                [('抑郁症', '常用药品', '盐酸舍曲林片')], [('抑郁症', '常用药品', '盐酸多塞平片')],
                [('抑郁症', '好评药品', '盐酸舍曲林片')], [('抑郁症', '好评药品', '盐酸氟西汀胶囊')],
                [('抑郁症', '好评药品', '脑力静胶囊')], [('抑郁症', '好评药品', '安乐片')],
                [('抑郁症', '好评药品', '氟哌噻吨美利曲辛片')], [('抑郁症', '好评药品', '盐酸文拉法辛胶囊')],
                [('抑郁症', '好评药品', '盐酸氯米帕明片')], [('抑郁症', '好评药品', '盐酸帕罗西汀片')],
                [('抑郁症', '好评药品', '盐酸多塞平片')], [('抑郁症', '好评药品', '苯妥英钠片')],
                [('抑郁症', '好评药品', '氯氮平片')], [('抑郁症', '好评药品', '盐酸度洛西汀肠溶胶囊')],
                [('抑郁症', '好评药品', '逍遥丸')], [('抑郁症', '好评药品', '舒眠胶囊')],
                [('抑郁症', '诊断检查', '颅脑CT检查')], [('抑郁症', '诊断检查', '血清锂')],
                [('抑郁症', '诊断检查', '脑氧代谢显像')], [('抑郁症', '诊断检查', '颅脑MRI检查')],
                [('抑郁症', '症状', '内向性思维')], [('抑郁症', '症状', '反复发作抑郁症')],
                [('抑郁症', '症状', '忧郁')], [('抑郁症', '症状', '精神创伤')], [('抑郁症', '症状', '思考困难感')],
                [('抑郁症', '症状', '违拗症')], [('抑郁症', '症状', '躁郁样')], [('抑郁症', '症状', '镇静药中毒')],
                [('抑郁症', '症状', '自我残伤行为')], [('抑郁症', '并发症', '失眠症')]],
     '脓肿': [[('脓肿', '推荐食谱', '紫菜黄瓜汤')], [('脓肿', '推荐食谱', '白菜粥')],
              [('脓肿', '推荐食谱', '瑶柱生菜白菜汤')], [('脓肿', '推荐食谱', '紫菜粥')],
              [('脓肿', '推荐食谱', '胡萝卜番茄汤')], [('脓肿', '推荐食谱', '白菜包子')],
              [('脓肿', '推荐食谱', '番茄芦笋紫菜汤')], [('脓肿', '忌吃', '白酒')], [('脓肿', '忌吃', '赤小豆')],
              [('脓肿', '忌吃', '啤酒')], [('脓肿', '忌吃', '白扁豆')], [('脓肿', '宜吃', '南瓜子仁')],
              [('脓肿', '宜吃', '鸡心')], [('脓肿', '宜吃', '鸡肝')], [('脓肿', '宜吃', '鹿肉')],
              [('脓肿', '所属科室', '普外科'), ('普外科', '属于', '外科')],
              [('脓肿', '常用药品', '甲硝唑氯化钠注射液')], [('脓肿', '常用药品', '注射用甲磺酸帕珠沙星')],
              [('脓肿', '好评药品', '注射用甲磺酸帕珠沙星')], [('脓肿', '好评药品', '甲磺酸帕珠沙星注射液')],
              [('脓肿', '好评药品', '甲硝唑氯化钠注射液')], [('脓肿', '好评药品', '奥硝唑氯化钠注射液')],
              [('脓肿', '好评药品', '甲磺酸帕珠沙星氯化钠注射液')], [('脓肿', '好评药品', '注射用盐酸头孢甲肟')],
              [('脓肿', '好评药品', '甲硝唑葡萄糖注射液')], [('脓肿', '诊断检查', '白细胞计数（WBC）')],
              [('脓肿', '诊断检查', '胸部B超')], [('脓肿', '诊断检查', '皮肤颜色')],
              [('脓肿', '症状', '帕里诺眼-腺综合征')], [('脓肿', '症状', '脓肿')], [('脓肿', '症状', '鼻根部水肿')],
              [('脓肿', '症状', '乏力')], [('脓肿', '症状', '手部急性化脓性感染')], [('脓肿', '症状', '喉管阻塞')],
              [('脓肿', '并发症', '败血症'), ('败血症', '推荐食谱', '木瓜鲤鱼煲')]],
     '败血症': [[('败血症', '推荐食谱', '草菇白菜奶汤')], [('败血症', '推荐食谱', '草菇莴笋汤')],
                [('败血症', '推荐食谱', '金银花黄瓜肉片汤')], [('败血症', '推荐食谱', '山楂橘子羹')],
                [('败血症', '推荐食谱', '金银花粥')], [('败血症', '推荐食谱', '橘香鱼丁')],
                [('败血症', '推荐食谱', '金橘柠檬汁')], [('败血症', '忌吃', '黄酒')], [('败血症', '忌吃', '江米酒')],
                [('败血症', '忌吃', '鹿肉')], [('败血症', '忌吃', '啤酒')], [('败血症', '宜吃', '莲子')],
                [('败血症', '宜吃', '核桃')], [('败血症', '宜吃', '白果（鲜）')], [('败血症', '宜吃', '鸡蛋')],
                [('败血症', '所属科室', '感染科')], [('败血症', '常用药品', '盐酸左氧氟沙星胶囊')],
                [('败血症', '常用药品', '氨苄西林胶囊')], [('败血症', '好评药品', '头孢羟氨苄颗粒')],
                [('败血症', '好评药品', '盐酸左氧氟沙星胶囊')], [('败血症', '好评药品', '替硝唑胶囊')],
                [('败血症', '好评药品', '乳酸左氧氟沙星分散片')], [('败血症', '好评药品', '氨苄西林胶囊')],
                [('败血症', '好评药品', '安宫牛黄丸')], [('败血症', '好评药品', '盐酸米诺环素胶囊')],
                [('败血症', '好评药品', '注射用头孢唑林钠')], [('败血症', '好评药品', '阿莫西林分散片')],
                [('败血症', '好评药品', '氧氟沙星片')], [('败血症', '好评药品', '左氧氟沙星片')],
                [('败血症', '好评药品', '乳酸左氧氟沙星片')], [('败血症', '好评药品', '盐酸克林霉素棕榈酸酯分散片')],
                [('败血症', '好评药品', '4:1分散片')], [('败血症', '诊断检查', '血清免疫球蛋白测定')],
                [('败血症', '诊断检查', '中间细胞(MID)')], [('败血症', '诊断检查', '碳源利用试验')],
                [('败血症', '诊断检查', '异形嗜中性粒细胞')], [('败血症', '诊断检查', '异型中性粒细胞')],
                [('败血症', '诊断检查', '凝固酶试验')], [('败血症', '诊断检查', '组织因子途径抑制物')],
                [('败血症', '诊断检查', '药敏试验')], [('败血症', '诊断检查', '宿主中介试验')],
                [('败血症', '诊断检查', '七叶苷水解试验')], [('败血症', '症状', '脑膜炎')],
                [('败血症', '症状', '肝功能衰竭')], [('败血症', '症状', '持续性弛张热')], [('败血症', '症状', '发烧')],
                [('败血症', '症状', '驻站医')], [('败血症', '症状', '脓性分泌物')],
                [('败血症', '症状', '下肢湿性坏疽')], [('败血症', '症状', '败血症')], [('败血症', '症状', '腹水')],
                [('败血症', '并发症', '黄疸')]]}



